load-test/results/async-cache.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/redirect.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * redirects: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 37636 complete and 0 interrupted iterations
redirects   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 78655 complete and 0 interrupted iterations
redirects   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 118234 complete and 0 interrupted iterations
redirects   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 154989 complete and 0 interrupted iterations
redirects   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 196479 complete and 0 interrupted iterations
redirects   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 240500 complete and 0 interrupted iterations
redirects   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 281452 complete and 0 interrupted iterations
redirects   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 320945 complete and 0 interrupted iterations
redirects   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 359156 complete and 0 interrupted iterations
redirects   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 399781 complete and 0 interrupted iterations
redirects   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 438721 complete and 0 interrupted iterations
redirects   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 477874 complete and 0 interrupted iterations
redirects   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 520724 complete and 0 interrupted iterations
redirects   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 556980 complete and 0 interrupted iterations
redirects   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 590032 complete and 0 interrupted iterations
redirects   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 629236 complete and 0 interrupted iterations
redirects   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 670706 complete and 0 interrupted iterations
redirects   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 711668 complete and 0 interrupted iterations
redirects   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 752476 complete and 0 interrupted iterations
redirects   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 791773 complete and 0 interrupted iterations
redirects   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 832469 complete and 0 interrupted iterations
redirects   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 868241 complete and 0 interrupted iterations
redirects   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 901634 complete and 0 interrupted iterations
redirects   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 939482 complete and 0 interrupted iterations
redirects   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 981796 complete and 0 interrupted iterations
redirects   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 1021619 complete and 0 interrupted iterations
redirects   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 1066453 complete and 0 interrupted iterations
redirects   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 1106420 complete and 0 interrupted iterations
redirects   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 1151045 complete and 0 interrupted iterations
redirects   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 1193201 complete and 0 interrupted iterations
redirects   [ 100% ] 100 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1193446 39778.491605/s
    checks_succeeded...: 100.00% 1193446 out of 1193446
    checks_failed......: 0.00%   0 out of 1193446

    ✓ 302

    HTTP
    http_req_duration..............: avg=2.35ms med=2.1ms  p(95)=4.36ms p(99)=7.97ms max=89.88ms
      { expected_response:true }...: avg=2.35ms med=2.1ms  p(95)=4.36ms p(99)=7.97ms max=89.88ms
    http_req_failed................: 0.00%   0 out of 1193446
    http_reqs......................: 1193446 39778.491605/s

    EXECUTION
    iteration_duration.............: avg=2.49ms med=2.17ms p(95)=4.72ms p(99)=9.57ms max=89.93ms
    iterations.....................: 1193446 39778.491605/s
    vus............................: 100     min=100          max=100
    vus_max........................: 100     min=100          max=100

    NETWORK
    data_received..................: 140 MB  4.7 MB/s
    data_sent......................: 92 MB   3.1 MB/s



running (0m30.0s), 000/100 VUs, 1193446 complete and 0 interrupted iterations
redirects ✓ [ 100% ] 100 VUs  30s