load-test/results/sync-nocache.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test/redirect.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m0s max duration (incl. graceful stop):
              * redirects: 100 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 3481 complete and 0 interrupted iterations
redirects   [   3% ] 100 VUs  01.0s/30s

running (0m02.0s), 100/100 VUs, 7221 complete and 0 interrupted iterations
redirects   [   7% ] 100 VUs  02.0s/30s

running (0m03.0s), 100/100 VUs, 10943 complete and 0 interrupted iterations
redirects   [  10% ] 100 VUs  03.0s/30s

running (0m04.0s), 100/100 VUs, 14660 complete and 0 interrupted iterations
redirects   [  13% ] 100 VUs  04.0s/30s

running (0m05.0s), 100/100 VUs, 17790 complete and 0 interrupted iterations
redirects   [  17% ] 100 VUs  05.0s/30s

running (0m06.0s), 100/100 VUs, 21036 complete and 0 interrupted iterations
redirects   [  20% ] 100 VUs  06.0s/30s

running (0m07.0s), 100/100 VUs, 24573 complete and 0 interrupted iterations
redirects   [  23% ] 100 VUs  07.0s/30s

running (0m08.0s), 100/100 VUs, 27739 complete and 0 interrupted iterations
redirects   [  27% ] 100 VUs  08.0s/30s

running (0m09.0s), 100/100 VUs, 31120 complete and 0 interrupted iterations
redirects   [  30% ] 100 VUs  09.0s/30s

running (0m10.0s), 100/100 VUs, 34880 complete and 0 interrupted iterations
redirects   [  33% ] 100 VUs  10.0s/30s

running (0m11.0s), 100/100 VUs, 38329 complete and 0 interrupted iterations
redirects   [  37% ] 100 VUs  11.0s/30s

running (0m12.0s), 100/100 VUs, 41779 complete and 0 interrupted iterations
redirects   [  40% ] 100 VUs  12.0s/30s

running (0m13.0s), 100/100 VUs, 45298 complete and 0 interrupted iterations
redirects   [  43% ] 100 VUs  13.0s/30s

running (0m14.0s), 100/100 VUs, 48829 complete and 0 interrupted iterations
redirects   [  47% ] 100 VUs  14.0s/30s

running (0m15.0s), 100/100 VUs, 52417 complete and 0 interrupted iterations
redirects   [  50% ] 100 VUs  15.0s/30s

running (0m16.0s), 100/100 VUs, 55993 complete and 0 interrupted iterations
redirects   [  53% ] 100 VUs  16.0s/30s

running (0m17.0s), 100/100 VUs, 59273 complete and 0 interrupted iterations
redirects   [  57% ] 100 VUs  17.0s/30s

running (0m18.0s), 100/100 VUs, 62924 complete and 0 interrupted iterations
redirects   [  60% ] 100 VUs  18.0s/30s

running (0m19.0s), 100/100 VUs, 66362 complete and 0 interrupted iterations
redirects   [  63% ] 100 VUs  19.0s/30s

running (0m20.0s), 100/100 VUs, 70104 complete and 0 interrupted iterations
redirects   [  67% ] 100 VUs  20.0s/30s

running (0m21.0s), 100/100 VUs, 73398 complete and 0 interrupted iterations
redirects   [  70% ] 100 VUs  21.0s/30s

running (0m22.0s), 100/100 VUs, 76969 complete and 0 interrupted iterations
redirects   [  73% ] 100 VUs  22.0s/30s

running (0m23.0s), 100/100 VUs, 80772 complete and 0 interrupted iterations
redirects   [  77% ] 100 VUs  23.0s/30s

running (0m24.0s), 100/100 VUs, 84456 complete and 0 interrupted iterations
redirects   [  80% ] 100 VUs  24.0s/30s

running (0m25.0s), 100/100 VUs, 88093 complete and 0 interrupted iterations
redirects   [  83% ] 100 VUs  25.0s/30s

running (0m26.0s), 100/100 VUs, 91713 complete and 0 interrupted iterations
redirects   [  87% ] 100 VUs  26.0s/30s

running (0m27.0s), 100/100 VUs, 95240 complete and 0 interrupted iterations
redirects   [  90% ] 100 VUs  27.0s/30s

running (0m28.0s), 100/100 VUs, 98816 complete and 0 interrupted iterations
redirects   [  93% ] 100 VUs  28.0s/30s

running (0m29.0s), 100/100 VUs, 102541 complete and 0 interrupted iterations
redirects   [  97% ] 100 VUs  29.0s/30s

running (0m30.0s), 100/100 VUs, 106011 complete and 0 interrupted iterations
redirects   [ 100% ] 100 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 106142  3535.186315/s
    checks_succeeded...: 100.00% 106142 out of 106142
    checks_failed......: 0.00%   0 out of 106142

    ✓ 302

    HTTP
    http_req_duration..............: avg=28.22ms med=24.57ms p(95)=60.19ms p(99)=83.4ms  max=192.46ms
      { expected_response:true }...: avg=28.22ms med=24.57ms p(95)=60.19ms p(99)=83.4ms  max=192.46ms
    http_req_failed................: 0.00%  0 out of 106142
    http_reqs......................: 106142 3535.186315/s

    EXECUTION
    iteration_duration.............: avg=28.26ms med=24.62ms p(95)=60.25ms p(99)=83.47ms max=192.48ms
    iterations.....................: 106142 3535.186315/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 13 MB  415 kB/s
    data_sent......................: 8.2 MB 272 kB/s



running (0m30.0s), 000/100 VUs, 106142 complete and 0 interrupted iterations
redirects ✓ [ 100% ] 100 VUs  30s